app/views/users/_index.html.erb

          <%= link_to follows_user_path(user) do %>
            <p>フォロー数:<%= user.following_user.count %></p>
---
SELECT "users".* FROM "users"