app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id
    @book_comment.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "nhnhnh"], ["user_id", 2], ["book_id", 3], ["created_at", "2022-06-07 12:33:50.881551"], ["updated_at", "2022-06-07 12:33:50.881551"]]

  def destroy
    #binding.pry
    @book_comment = BookComment.find(params[:id])
    @book_comment.destroy
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]