app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aa"], ["introduction", ""], ["updated_at", "2022-06-07 02:36:58.921424"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def follows
    user = User.find(params[:id])